{"class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "LSTM", "config": {"trainable": true, "bias_regularizer": null, "unit_forget_bias": true, "dtype": "float32", "dropout": 0.0, "activity_regularizer": null, "name": "lstm_1", "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "return_sequences": false, "batch_input_shape": [null, 30, 89], "go_backwards": false, "implementation": 1, "stateful": false, "activation": "tanh", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "recurrent_constraint": null, "recurrent_dropout": 0.0, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 128, "unroll": false, "return_state": false, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dense", "config": {"trainable": true, "activation": "softmax", "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "name": "dense_1", "units": 89, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "kernel_regularizer": null}}]}, "keras_version": "2.2.4"}