{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"layers": [{"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "name": "lstm_1", "batch_input_shape": [null, 30, 89], "trainable": true, "dropout": 0.0, "recurrent_dropout": 0.0, "bias_regularizer": null, "return_state": false, "use_bias": true, "recurrent_constraint": null, "unroll": false, "activity_regularizer": null, "stateful": false, "return_sequences": false, "kernel_regularizer": null, "units": 128, "go_backwards": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "dtype": "float32", "kernel_constraint": null, "implementation": 1, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "activation": "tanh", "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 89, "name": "dense_1", "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "softmax", "use_bias": true}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential"}